studyapppw1/src/Documents/РасходМатериалов/РасходМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходМатериалов</name>
  <registerRecords>AccumulationRegister.ОстаткиМатериалов</registerRecords>
  <attributes>
    <name>Производство</name>
    <type>
      <types>DocumentRef.Производство</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

studyapppw1/src/AccumulationRegisters/ОстаткиМатериалов/ОстаткиМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиМатериалов</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Материал</name>
    <type>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>EnumRef.ЕдиницыИзмерения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

studyapppw1/src/Documents/РасходМатериалов/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

    // Скажем платформе, что будем писать движения в регистр
    Движения.ОстаткиМатериалов.Записывать = Истина;

    // На всякий случай
    Если Склад = Неопределено Тогда
        Отказ = Истина;
        Сообщить("Не указан склад!");
        Возврат;
    КонецЕсли;

    // Движения по строкам табличной части
    Для Каждого СтрокаМат Из Материалы Цикл

        Если СтрокаМат.Материал = Неопределено Тогда
            Продолжить;
        КонецЕсли;

        Если СтрокаМат.Количество = Неопределено Или СтрокаМат.Количество <= 0 Тогда
            Продолжить;
        КонецЕсли;

        Запись = Движения.ОстаткиМатериалов.Добавить();
        Запись.Период = Дата;
        Запись.ВидДвижения = ВидДвиженияНакопления.Расход;

        Запись.Материал = СтрокаМат.Материал;
        Запись.Склад = Склад;
        Запись.ЕдиницаИзмерения = СтрокаМат.Материал.ЕдиницаИзмерения;
        Запись.Количество = СтрокаМат.Количество;

    КонецЦикла;

КонецПроцедуры
